 DEFINE PROGRAM(ZUIDPLT) GROUP(ZUID)
        LANGUAGE(ASSEMBLER) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
        USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)
        EXECKEY(CICS) CONCURRENCY(THREADSAFE) API(OPENAPI) DYNAMIC(NO)
        EXECUTIONSET(FULLAPI) JVM(NO)
 DEFINE PROGRAM(ZUIDSTCK) GROUP(ZUID)
        LANGUAGE(ASSEMBLER) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
        USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)
        EXECKEY(CICS) CONCURRENCY(THREADSAFE) API(OPENAPI) DYNAMIC(NO)
        EXECUTIONSET(FULLAPI) JVM(NO)
 DEFINE PROGRAM(ZUID001) GROUP(ZUID)
        LANGUAGE(ASSEMBLER) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
        USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)
        EXECKEY(CICS) CONCURRENCY(THREADSAFE) API(OPENAPI) DYNAMIC(NO)
        EXECUTIONSET(FULLAPI) JVM(NO)
 DEFINE TRANSACTION(UPLT) GROUP(ZUID)
        PROGRAM(ZUIDPLT) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
        TASKDATALOC(ANY) TASKDATAKEY(USER) STORAGECLEAR(NO)
        RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
        ROUTABLE(NO) PRIORITY(1) TRANCLASS(TCLID07) DTIMOUT(NO)
        RESTART(NO) SPURGE(NO) TPURGE(NO) DUMP(YES) TRACE(YES)
        CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)
        WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)